//
// Created by taiyehu on 2023/10/15.
//

#ifndef C2023_CHALLENGE_ALL_C
#define C2023_CHALLENGE_ALL_C
/*#include <stdbool.h>
#include <stdio.h>
#include <conio.h>
#include <windows.h>
//*作墙， 作路，+作人，#作箱子,@表示终点
bool flag,flag1;
int extern dx,dy;
int extern cnt=0;
char extern m[8][11]={
        {'*','*','*','*','*','*','*','*','*','*','*'},
        {'*','*','*','*','*','*','*','*','*','*','*'},
        {'*','*','*',' ',' ',' ',' ',' ','*','*','*'},
        {'*','*','*','#','*','*','*',' ',' ',' ','*'},
        {'*','*',' ',' ',' ','#',' ',' ','#',' ','*'},
        {'*','*',' ','@','@','*',' ','#',' ','*','*'},
        {'*','*','*','@','@','*',' ',' ',' ','*','*'},
        {'*','*','*','*','*','*','*','*','*','*','*'},
};
//存箱子位置
int extern finx[5]={0,5,5,6,6};
int extern finy[5]={0,3,4,3,4};*/
#endif //C2023_CHALLENGE_ALL_C
